[
  {
    "id": 1,
    "name": "Kiruna",
    "category": "nature",
    "coordinates": {
      "latitude": 67.8503,
      "longitude": 20.2559
    },
    "description": "Sweden's northernmost city, famous for the Northern Lights, midnight sun, Icehotel, and Sami culture.",
    "hours": "Always accessible",
    "admission": "Free to explore",
    "website": "https://www.visitkiruna.se",
    "color": "#ff6b6b",
    "image": "/sv/png/1.png",
    "detailedDescription": "Kiruna, located 145 km north of the Arctic Circle, is Sweden's northernmost city and a gateway to unique Arctic experiences. The city is world-famous for the original Icehotel in nearby Jukkasjärvi, where artists create stunning ice sculptures and rooms each winter. Kiruna offers spectacular views of the Northern Lights from September to March and experiences the midnight sun from May to July. The city is also home to the Sami people, Sweden's indigenous population, and visitors can learn about their culture and traditions. Additionally, Kiruna is undergoing a historic city transformation, with the entire city center being relocated due to iron ore mining expansion."
  },
  {
    "id": 2,
    "name": "Skara Sommarland",
    "category": "entertainment",
    "coordinates": {
      "latitude": 58.4085,
      "longitude": 13.5509
    },
    "description": "Water & theme park with slides, flumes, a go karting area & live entertainment stunt shows.",
    "hours": "Open until 7 PM (varies by season)",
    "admission": "From 389 SEK",
    "website": "https://sommarland.se",
    "color": "#4169e1",
    "image": "/sv/png/2.png",
    "detailedDescription": "Skara Sommarland is Sweden's largest water park and one of Scandinavia's most popular summer destinations. The park features numerous water attractions including wild river rides, wave pools, and adrenaline-pumping water slides. Beyond water activities, visitors can enjoy go-karting, mini golf, and live entertainment shows. The park is particularly famous for its family-friendly atmosphere and has attractions suitable for all ages, from toddler pools to extreme slides for thrill-seekers."
  },
  {
    "id": 3,
    "name": "Gothenburg Gokartcenter",
    "category": "entertainment",
    "coordinates": {
      "latitude": 57.7209,
      "longitude": 11.8145
    },
    "description": "Go-karting venue offering exciting racing experiences for all skill levels.",
    "hours": "Varies",
    "admission": "Contact for pricing",
    "website": "https://gokart.se",
    "color": "#ff9f1a",
    "image": "/sv/png/3.png",
    "detailedDescription": "Gothenburg Gokartcenter offers one of Sweden's most exciting go-karting experiences with both indoor and outdoor tracks. The facility features high-performance karts and professionally designed tracks that challenge both beginners and experienced racers. They offer various racing formats including arrive-and-drive sessions, organized races, and corporate events. The center also provides all necessary safety equipment and instruction, making it accessible for families, groups of friends, and team-building activities."
  },
  {
    "id": 4,
    "name": "Öckerö",
    "category": "nature",
    "coordinates": {
      "latitude": 57.7108,
      "longitude": 11.6582
    },
    "description": "An island and locality, seat of Öckerö Municipality with beautiful coastal scenery and maritime heritage.",
    "hours": "Always accessible",
    "admission": "Free",
    "website": "",
    "color": "#00d2d3",
    "image": "/sv/png/4.png",
    "detailedDescription": "Öckerö is a charming island in the Gothenburg archipelago, offering visitors a glimpse into authentic Swedish coastal life. The island features picturesque fishing villages, rocky shores perfect for swimming and sunbathing, and scenic walking trails. The maritime heritage is evident in the traditional boat houses and the local museum showcasing the island's seafaring history. Visitors can enjoy fresh seafood at local restaurants, explore the nature reserve, or simply relax and enjoy the peaceful island atmosphere. The island is easily accessible by free ferry from the mainland."
  },
  {
    "id": 5,
    "name": "Ales stenar",
    "category": "historical",
    "coordinates": {
      "latitude": 55.3826,
      "longitude": 14.0544
    },
    "description": "1400-year-old monument in the shape of a ship, made up of 59 large stones & perched on a hill.",
    "hours": "Open 24 hours",
    "admission": "Free",
    "website": "https://visitystadosterlen.se",
    "color": "#8b572a",
    "image": "/sv/png/5.png",
    "detailedDescription": "Ales stenar (Ale's Stones) is Sweden's largest preserved stone ship formation, dramatically positioned on a hill overlooking the Baltic Sea near Kåseberga. This mysterious monument consists of 59 massive boulders arranged in a 67-meter-long ship formation, dating back to around 600 AD. The site offers breathtaking views of the coastline and is particularly magical at sunrise and sunset. While its exact purpose remains debated - theories range from astronomical calendar to burial monument - the site continues to captivate visitors with its ancient mystery and spectacular setting."
  },
  {
    "id": 6,
    "name": "Visby",
    "category": "historical",
    "coordinates": {
      "latitude": 57.6334,
      "longitude": 18.2791
    },
    "description": "Town on Gotland known for its well-preserved medieval town wall, defensive towers, churches and cobblestone streets lined with cafes.",
    "hours": "Always accessible",
    "admission": "Free to explore",
    "website": "",
    "color": "#d35400",
    "image": "/sv/png/6.png",
    "detailedDescription": "Visby, the 'City of Roses and Ruins,' is a UNESCO World Heritage site and one of the best-preserved medieval cities in Scandinavia. The town is surrounded by a remarkable 3.4 km medieval wall with 44 towers, built in the 13th century. Within the walls, cobblestone streets wind past merchant houses, church ruins, and blooming roses in summer. The town comes alive during Medieval Week in August, when knights, merchants, and minstrels fill the streets. Visby offers a unique combination of historical significance, architectural beauty, and modern Swedish coastal charm."
  },
  {
    "id": 7,
    "name": "Fårö",
    "category": "nature",
    "coordinates": {
      "latitude": 57.9722,
      "longitude": 19.2462
    },
    "description": "A scenic island north of Gotland known for its unique rock formations, beaches, and natural beauty.",
    "hours": "Always accessible",
    "admission": "Free",
    "website": "",
    "color": "#27ae60",
    "image": "/sv/png/7.png",
    "detailedDescription": "Fårö is a small island paradise north of Gotland, famous for its distinctive raukar (limestone sea stacks) and pristine beaches. The island gained international recognition through filmmaker Ingmar Bergman, who lived here and used it as a location for several films. Visitors can explore the otherworldly rock formations at Langhammars, relax on the white sand beaches of Sudersand, or visit the Bergman Center. The island maintains a wild, unspoiled character with its sparse population, sheep farms, and dramatic coastal landscapes, making it perfect for nature lovers and those seeking tranquility."
  }
]
